GNU Prolog 1.4.4 (64 bits)
Compiled Nov  6 2014, 18:04:28 with gcc
By Daniel Diaz
Copyright (C) 1999-2013 Daniel Diaz
| ?- $Id: group2.tests,v 1.2 2016-11-21 14:06:16-08 - - $

yes
| ?- compiling /afs/cats.ucsc.edu/users/b/tqiu1/cmps112/assignment4/database.pl for byte code...
/afs/cats.ucsc.edu/users/b/tqiu1/cmps112/assignment4/database.pl compiled, 75 lines read - 11177 bytes written, 7 ms

(1 ms) yes
| ?- compiling /afs/cats.ucsc.edu/users/b/tqiu1/cmps112/assignment4/functions.pl for byte code...
/afs/cats.ucsc.edu/users/b/tqiu1/cmps112/assignment4/functions.pl compiled, 116 lines read - 15033 bytes written, 8 ms

(2 ms) yes
| ?- Error: Invalid Path.

(1 ms) no
| ?- depart  sfo  San Francisco     09:00
arrive  lax  Los Angeles       09:42
depart  lax  Los Angeles       12:00
arrive  sfo  San Francisco     12:42
depart  sfo  San Francisco     14:00
arrive  lax  Los Angeles       14:42
depart  lax  Los Angeles       15:30
arrive  sjc  San Jose          16:08

yes
| ?- depart  sjc  San Jose          11:15
arrive  lax  Los Angeles       11:53

yes
| ?- depart  sfo  San Francisco     09:00
arrive  lax  Los Angeles       09:42
depart  lax  Los Angeles       13:30
arrive  sea  Seattle-Tacoma    15:28

(1 ms) yes
| ?- depart  mia  Miami             09:00
arrive  atl  Atlanta           10:12
depart  atl  Atlanta           11:30
arrive  lax  Los Angeles       15:25

yes
| ?- depart  mia  Miami             09:00
arrive  atl  Atlanta           10:12
depart  atl  Atlanta           11:30
arrive  lax  Los Angeles       15:25
depart  lax  Los Angeles       19:30
arrive  sjc  San Jose          20:08

yes
| ?- depart  lax  Los Angeles       14:00
arrive  nyc  New York City     19:02

yes
| ?- 
